cf/DataProcessors/QueryConsole.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>QueryConsole</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UseAutosave</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutoSavePeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PathToForms</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvailableDataTypes</Name>
					<Type>
						<v8:Type>v8:TypeDescription</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>The name of the XML file where queries and parameters are stored.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutputRefValuesInQueryResults</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TabOrderType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AlternatingColorsByQuery</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Queries</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Id</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Comment>Query name</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Text</Name>
							<Comment>Query text</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RunTime</Name>
							<Comment>Execution time in seconds</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RowsCount</Name>
							<Comment>The number of rows returned as a result of the query</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ResultAddress</Name>
							<Comment>The address of the temporary storage where the result is stored</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QueryResultsAddress</Name>
							<Comment>Address of the array of query results in temporary storage</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QueryPlanStorageAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Parameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Id</Name>
							<Comment>Id</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QueryID</Name>
							<Comment>Request ID</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Name</Name>
							<Comment>Parameter name</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Comment>Type</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Comment>Parameter value</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/DataProcessors/QueryConsole/Forms/PointInTime/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DataProcessorObject    = DataProcessorObject2();
	Object.PathToForms = DataProcessorObject.Metadata().FullName() + ".Form";
	
	// Read transfer parameters.
	TransferParameters = GetFromTempStorage(Parameters.StorageAddress); // See DataProcessorObject.QueryConsole.PutQueriesInTempStorage
	Object.Queries.Load(TransferParameters.Queries);	
	Object.Parameters.Load(TransferParameters.Parameters);
	Object.FileName = TransferParameters.FileName;
	CurrentQueryID = TransferParameters.CurrentQueryID;
	CurrentParameterID = TransferParameters.CurrentParameterID;
	
	Try   // In case a form is opened not from the main form.
		PointInTime = ValueFromStringInternal(Parameters.Value);
		Date          = PointInTime.Date;
		Ref        = PointInTime.Ref;
	Except
		FillValues();
	EndTry;
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure WriteAndClose(Command)
	ExportPointInTimeServer();
EndProcedure

#EndRegion

#Region Private

&AtServer
Function DataProcessorObject2()
	Return FormAttributeToValue("Object");
EndFunction

&AtClient
Procedure ExportPointInTimeServer()
	Owner			= FormOwner;
	OwnerFormName 	= Owner.FormName;
	MainFormName 	= Object.PathToForms + ".Form";
	
	If  OwnerFormName = MainFormName Then 
		TransferParameters = PutQueriesInStructure(CurrentQueryID, CurrentParameterID);
		Close(); 
		Owner.Modified = True;
		Notify("ExportQueriesToAttributes", TransferParameters);
	Else
		PointInTimePresentation = "";
		InternalTimeMoment = InternalValueOfPointInTime(PointInTimePresentation);
		Close();
		TransferParameters = New Structure("InternalTimeMoment, PointInTimePresentation",
			InternalTimeMoment, PointInTimePresentation);
		Notify("GetPointInTime", TransferParameters);
	EndIf;	
EndProcedure	

&AtServer
Function PutQueriesInStructure(QueryID, ParameterId)
	FormParameters = Object.Parameters;
	
	PointInTimePresentation = "";
	For Each Page1 In FormParameters Do
		If Page1.Id = CurrentParameterID Then
			Page1.Type		 		= "PointInTime";
			Page1.Value 		= InternalValueOfPointInTime(PointInTimePresentation);
			Page1.TypeInForm		= NStr("ru = 'Момент времени';
										|en = 'Point in time';");
			Page1.ValueInForm	= PointInTimePresentation;
		EndIf;
	EndDo;
		
	TransferParameters = New Structure;
	TransferParameters.Insert("StorageAddress", DataProcessorObject2().PutQueriesInTempStorage(Object,QueryID,ParameterId));
	Return TransferParameters;
EndFunction	

&AtServer
Function InternalValueOfPointInTime(Presentation)
	PointInTime = New PointInTime(Date, Ref);	
	Presentation = DataProcessorObject2().GenerateValuePresentation(PointInTime);
	
	Return ValueToStringInternal(PointInTime);
EndFunction

&AtServer
Procedure FillValues()
	FormParameters = Object.Parameters;
	For Each CurrentParameter In FormParameters Do 
		If CurrentParameter.Id = CurrentParameterID Then 
			Value = CurrentParameter.Value;
			If IsBlankString(Value) Then 
				Return;
			Else
				Break;
			EndIf;
		EndIf;	
	EndDo;
	
	PointInTime = ValueFromStringInternal(Value);
	If TypeOf(PointInTime) <> Type("PointInTime") Then 
		Return;
	EndIf;
	
	Date 	= PointInTime.Date;
	Ref 	= PointInTime.Ref;
EndProcedure	

#EndRegion
